"{\"text\": \"Thank you very much. And thank you to SFSCon for having me. I'm in particularly, I'm particularly indebted to the organizers because as we were arranging my talk, I was on vacation with just my cell phone. I responded to an email and said, absolutely, I'm sending you that email tonight, and then proceeded to dump my phone in the ocean. So both my boss and her boss, Stormy Peters and Debra Bryant stepped in to save this communication and SFSCon was very, very hospitable to me. So thank you. So the secret to keeping your community strong for decades. We've had two talks this morning about open source and about community at a high level, and they've been really valuable. So I don't want to repeat what those folks have said. Instead, I want to take you on a bit of a history through the Fedora project and talk about how we have dealt with community issues in hopes that our lessons will serve as either inspiration or examples of things you could do, things you definitely don't want to do, or just idea generation. Specifically I want to talk to you today about governance, communities at the global and local level, budgets, always a fun subject, onboarding new contributors, and diversity. To put this in context, if you don't know, the Fedora project is an operating system. We produce an entire distribution and software set. We have over 350 active contributors every week. We were started in 2003, so we're an older community, and we've done 26, soon to be 27 releases of our operating system. The other big thing to know in this context is we are a corporately sponsored project. While we receive funds from several different sources, we do have one sponsor who provides the majority of our funding. So in 2002, an undergraduate in North Carolina decided that what was then called Red Hat Linux was missing some pieces of software that were important. And so he decided to build those pieces of software and provide them to the world. And that was a project called Fedora US. Had nothing to do with Red Hat, was completely unofficial. It was called Fedora as a nod to the hat that is in Red Hat's logo, and that was it. But in 2003, Red Hat realized that it needed to have a greater community around its software, and it decided to move down that road. And so in 2003, Red Hat made some business decisions. Red Hat Linux goes away, Red Hat Enterprise Linux comes on the scene. Those are not important to this story. What is important is that they began working very closely with this Fedora US community. Now Red Hat's initial approach was to release something called Fedora Core 1. It was what used to be Red Hat Linux that the undergraduate was building against, but it was open sourced. In a more full way than Red Hat Linux had been. Red Hat Linux had always shipped its source when GA happened. Fedora Core 1 represented an opportunity for the source to be continuously out there. Now it wasn't perfect. For one thing, you had to work for Red Hat to contribute to Fedora Core. And there was a Fedora project leader, but who was mostly focused on making sure we had something to ship in six months. And Fedora US was still floating out to the side building their packages. But the world evolves. We got a couple of releases out. And with Fedora Core 3, we got to the point where Fedora Extras, which is what used to be Fedora US, could ship side by side with the code. And the Fedora Advisory Board was formed to start to give the community a voice. Again, it's an evolutionary process though. The Fedora Advisory Board was literally that, an advisory board. There's still a Fedora project leader out there calling all the decisions. The Fedora Advisory Board was extremely open. It was also a mailing list. Anybody could join and offer their opinion. So in that sense, it was a great move forward. But it wasn't perfect. So in about 2007, we made yet another change in our governance. And we formed what's called the Fedora Board. And it's the first time you start to see a structure within the project. Because over time, what had been the Fedora Extras group had formed a little subcommittee called Fedora Packages, or Fedora Packaging Committee, that tried to guide how projects should look and how software should look. And eventually, that becomes formalized and part of a Fedora Engineering Steering Committee that is going to give guidance into what the community is producing as Fedora. A key point here is the code base is merged. You didn't have to work for Red Hat anymore to contribute to Core. It was all truly open to community contribution. And so now we've got this structure that we've built where we've got an engineering group, we've got a Fedora Ambassadors group who wants to go out and talk to people about the software, attract new contributors and users. We've also got these little WGs floating off to the side. Because independence has been a strong value in Fedora from the beginning. The continued belief was anybody could form a working group about anything. This was explicitly summed up, I've got the quote here, actually I don't have the quote on this slide, I apologize. I have the quote here in a statement by one of the Fedora project leaders which was, if the board says we're going in direction X, you're allowed to form a working group that says anti-X and to try and march off in that different direction. Because it may be that you don't agree and we want to give you a place to do that. Or it may be that you think we've made the wrong choice and we want to give you a platform to show us what the right choice was. But in all of this, we put together this structure. You'll notice one other thing, I don't know which one of these makes a light, but the one above the engineering steering committee is dotted. And that's because the way the board was structured, the engineering steering committee still had lots of responsibilities on its own. It could drive the entire technical decision making of the project. It did not have to go to the board for permission. So we still had the engineers driving the outcome and a board starting to drive a community governance model. We get to today. We've evolved again. We've renamed the board the council, but it's actually changed a lot. The council is now made up of a whole group of representative people. The boards had been appointed and occasionally elected. The council has come forward with the ideas of we are going to drive the whole project in a direction without squashing independence. But before we had engineering over here doing one thing, working groups pushing off in all kinds of directions and ambassadors and other community groups like lost, like what are we actually going to ship in six months? So now we have a single thought, a single mission of what we're trying to produce, who we're trying to serve, while not squashing any of that independence, but bringing everything to roll up to an output that's consumable by people. We also gained a lot of other working groups. That's important because we continue to crystallize how people can work together. But you can see, for example, I've pulled out the example of globalization here. It serves multiple different groups. It localizes software, so it works with the Fedora engineering groups. But it also localizes websites, outreach activities, et cetera, works on translation as a pathway for contribution, so it has to work with the ambassadors groups. We've had two or three innovations in the last year that I also want to point out. One of them is the Mindshare committee. It literally sprang into existence last month based on proposals from March of this year. What we realized before Mindshare was that all of these teams, docs, design, com ops, et cetera, they all floated up to the council, but they weren't really working together. We didn't have the unity of thought on the outreach side of our project that we did on the engineering side of our project. And so Mindshare is a governance change for us to try and get some unity of thought there so that, again, we're all kind of swimming in the same basic direction, that we're all going down the same path. Another set of innovations that we've had is the way the Fedora council is structured. You'll notice that in the slides previous to this, we had a Fedora project leader who eventually became a member of the board. In this slide, we've added some more people. Critically for the purposes of this talk, we've added a diversity advisor, and I'm going to talk about that one a bit more in the diversity portion. The other thing that I'm really proud of that we added was my job. I am the second Fedora community action and impact coordinator in the project, and we added my position to help the Fedora project lead and the council continue to implement the ideas on both the engineering and community sides of the equation. The way that the roles work, everybody thinks about everything. I tend to think a little more about community than engineering. My counterpart, Matthew, the Fedora project lead, tends to think a little more about engineering than community. But if you looked at our individual work product over the last three months, I've been doing more engineering, I think, than he has, and he's been doing more community than I have. So it's kind of a floating relationship. All of these changes in governance came about both because of trying to accomplish better relationships between a corporate sponsor and a community, and then better relationships in a community, and just the changing times. Over the last 14 years, open source has changed a lot, and so it's necessitated a change in how you govern. And I think a critical thing to take away from all of this is, no matter what you're thinking about for your governance structure, expect to revisit it. It is not set in stone, walk away. Because in five years, the world's going to be different. Community. Community is hard. Fedora has a global community. I said we have over 350 contributors every week, and I'm going to show you a graph about that. Those don't represent all of our community members. There are way more. There are people who don't contribute every week, for example. So in our global community, because we're used all around the world, we have decided to, of course, use online mechanisms of communication, but we've put together several conferences and events to try and bring our community together. Specifically, we run a contributor conference every year. We run something called Fudcons, which we've not run this year, and I'll tell you why, to try and bring users and developers together. And we do what are called Fedora Activity Days, where we actually provide the opportunity for everybody working on a particular subproject to meet in a physical location to get something done. And as we all know, that can be really critical to helping move forward virtual relationships and also getting virtual work done. But this is not without challenges. Our Flock Conference rotates between the U.S. and Europe. It has not always been well represented by people from other parts of the world. We've got to fix that. Our Flock Conference has often been a talking conference, where people will come and talk about their plans for something or their proposals, but we didn't seem to get a lot done. We brought everybody to one place, but we didn't have necessarily a tangible output. So we've been trying to shift to a more do perspective. Fudcons, frankly, they're confusing. We've been holding them in LATAM and APAC, and we weren't sure what we were getting out of them. Every single one of them was different. None of them seemed to necessarily build on each other. They didn't seem to leave the local communities changed. They didn't seem to leave the global community changed. So this year, the board said, we're not funding Fudcons. We're funding good ideas. Tell us what's actually going to work for you. We want to do that, instead of a dictation from the top that thou shalt have a Fudcon. The other thing that we've had a challenge with around FADs has been that traditionally our budget model has led to FADs needing to have a regional justification, and I'll show you that in a few minutes. But what we have done instead is said, FADs are a global phenomenon. If you're pulling together all of the, say, Southeast language speakers who do translations, sure, it's a regional thing, but it has global impact on the way that we're going to deliver software. But if you're wanting to talk to people who run our build systems, they're all over the world. We don't need to justify this as a European-only thing. The way that we're looking at solving this is through communication. We literally just need to help people understand that Flock is a global experience and we have funding or assistance or just the desire to have them there. We need people to understand what they want to do locally and then communicate that so that we can execute. We need people to tell us that their working group would be well served by being one week in a place physically together. That communication is critical. On the local side, we have these ambassador groups. The ambassador groups have a huge mandate. They want to talk to other Floss communities. They want to talk to potential contributors. They want to talk to potential users. They want to be the public marketing face of the project. They want to make sure the world understands us. We've divided our local work into four regions of the world, North America, Europe, Middle East and Africa, Asia Pacific and Latin and South America. Challenges rise up. Those divisions were made in 2003, pretty much, 2006, but they're actually not divisions Fedora defined. Our corporate sponsor happens to divide the world into four regions for sales purposes. You'll never guess what those four regions are. We didn't pick those regions. As a consequence, you've got places like Asia Pacific that is massive, like literally getting everyone in Asia Pacific on a call is a challenge because of time zones or an IRC meeting is a challenge because of time zones. The needs in countries in LATAM, in Europe, in Asia Pacific vary greatly. The cultures are extraordinarily different. Even in a more homogenous looking place like LATAM, don't forget you've got Brazil. They don't speak Spanish as their first language, but they don't have, I'll say, the European excess of languages. It's a different kind of a challenge there. North America struggles because North America is basically America, the United States. Canada, there's not a strong presence there. For some reason, Mexico wound up lumped into that group, but has much more cultural identity South than North and does a better job working with people who are technically not in their region. The regions also work regionally, but they're trying to focus on local efforts. This creates a problem when you're sitting in an IRC meeting and you're trying to explain Why is it important that we go to South Tyrol, to someone who lives in the Middle East? I mean, yes, on one level they get it, but on another level they're like, why am I even being asked to give you permission for this? I now feel great responsibility to do due diligence, which can slow down a process that should be more fluid because it's the right thing to do locally. We have a challenge as well that as we have grown our project. Some of our ambassadors are active only as ambassadors. When you couple this with the fact that some working groups can be hard to talk to, you wind up in a situation where if you meet someone on a booth, at a meeting, at an event, who goes, oh, I want to work on this, you don't know anything about that area. You may not be sure we do it, and if you are, you may not know how to contact those people and get a response. So again, communication is a huge issue here. The other thing that we're doing with this is this mind share committee I talked about, where we're trying to drive all of the groups that have anything to do with our external presence and outreach into one committee to talk to each other. So that when the ambassadors go out and say, the Fedora project's awesome because it does function X, the documentation tells you how to do that. The marketing material emphasizes that. The solutions that we were aiming for are in that direction, because otherwise you wind up with a very disjoint picture of what we're trying to accomplish. Budgets. I happen to love budgets. I should have been an accountant. I happen to love taxes. You can talk to me about that later. For most of the entire project, Red Hat has been the primary sponsor, and Red Hat has been extraordinarily generous to the Fedora project, but has basically run a black box budget. The project had no idea how much money it could actually spend. It didn't know how deep the well was, if you're familiar with that idiom. This has resulted in an ask Red Hat mentality that creates challenges. The first is historical precedence. If we got it last year, we're likely to get it next year, so don't do anything different. On the other hand, it results in a challenge across cultures. Many of us in this room may come from cultures where it is not normal to ask for things. You wait for them to be told to you, or it's not normal to challenge with a new idea and see if anybody likes it. Some of those are challenges we face in general in open source, but when you add money to the equation, it gets even worse. The other challenge was if you don't know how much money you have, you're scared to spend any money, because that might be your last dollar, and are you sure you wanted that to be what you spent your last dollar on? So all of these things were really difficult, so we switched it. Red Hat agreed to give the community a budget. We moved the allocation of that budget formally into our council so that there was a clear delegation for how the money should flow, and we got really transparent. We run a website called budget.fedoraproject.org, which I'm particularly proud of, that literally shows you where every dollar is going. You can break it all the way down. When your community knows this, you are shifting the equation from resources to impact, and that can be huge in trying to serve the community of users that you want to serve. Challenges are still there. Budgets and money are very hard to understand and are very culturally rooted. When the council first said no more FUD cons, the APAC and LATAM regions heard, you may not do this, do not ask. What we really said was Americanese and Europeanese, for we want you to have a good idea, we have a lot of money, please come ask us for some. That did not communicate across cultures. You have a lot of challenges around numbers. Now we know how deep the well is. People are now scared to spend a dollar for completely different reasons. You also can see the whole pot of money, and some of our contributors live in countries where they are like, whoa, that's like everything. Some of our contributors live in countries and they are like, all right, yeah, it might buy a nice house if I had it all, but we can do a lot of good work with this. It just changes that equation entirely when you are trying to figure out how do you allocate money across those kinds of discrepancies. The release party that I would hold in Italy is going to be more expensive than the release party that I would hold in Tirana, because food is just more expensive here, has nothing to do with anything else in the world. How do we allocate money to make sure that we don't wind up with surpluses and deficits? The other is, this is a huge issue with change is scary. Now you have to have good ideas, you don't get to just go ask somebody. You actually have to justify it up to a council, it's a very open process, people can see what is being traded off against. But this is a huge win. It's the same decisions we make when we are choosing between two patches to implement a feature set. These are huge. I want to talk a little bit about Fedora's contributors as well. This is a contributor chart showing our contributors every week. The colors are less relevant. We have a definition for what we call an active contributor, it's at the top here. You have to have been active at least four weeks total in the last year to be considered an active contributor. We have multiple versions of this chart, I didn't know which one I had grabbed. The important thing to look at is the orange color at the bottom, it's a stacked chart, represents people who have been active for over a year, or is it two years? Two years. The blue line at the top represents every single person who made a contribution that week without regard to their activity status. You look at this chart and you might go, well, we have a really stable population. You could look at this chart and go, I might see an upward trend or a downward trend. Somebody else looks at this chart and they go, what I see here is a community that attracts new people, they stay for about two years and then they fall off the end. So we have great data, we just don't quite know what it means yet. The other thing that's a problem with this chart, you'll notice that mostly at the top, we have a massively instrumented infrastructure that hasn't actually been fully implemented, so like this doesn't include translations, it doesn't include most docs work. So we have to use proxies to try and figure this out. So this leads into onboarding new contributors. Our challenges in our community are, what does contribution actually mean? Because we're not counting things like translations, are we saying they're not important or is it literally just we need the code patch to instrument that system? Who are we going to focus on? What is the most important contributor we could add tomorrow if we could only add one? Who's our target audience? We have a really weird problem in Fedora, which some of your projects may have. Contribution to Fedora is not what most people think contribution to Fedora is. I get emails constantly from people going, hey, I just graduated school, I know everything there is to know about Java, and I want to write code for Fedora. No. I mean, it's not that that's a bad thing, but we don't have any Java. I mean, like, I'm sorry, there are many wonderful projects written in Java. We really want you to go contribute to those so that when we package that software up, it's even better. We run our web interfaces all in Python. Want to learn Python? So contribution can be hard to define. Contribution is also weird. I had a conversation over lunch with somebody, and they said, I want to work with containers. And I said, do you want to build applications that are in containers, or do you want to actually, like, make containers better? Because the company I work for, we make containers better. We don't build very many applications in containers, but there are lots of companies that build applications in the containers we've just made better. Contribution is hard. The other thing that we have learned from all of the studies, GitHub and others, is that docs are critical for contributor and user onboarding, and we struggle with documentation just like every other project. So what we're doing is continuing some of our traditional onboarding efforts, but we've retooled the documentation so that we are in a place where that is easier to contribute to, which should result in better documentation, which should result in better user and contributor onboarding. We're also spinning up some projects to do some intro skill sessions. We've done seven of them this year. And we're working with the community operations team to work with working groups to actually define an onboarding process. Because no one can join your team if you don't tell them how. It's the same way as no one can contribute to your project if you don't tell them what language it's in, how to contribute code, do you want an email patch, a GitHub pull, what? We're also, and I would encourage those of you in older communities to consider this, looking at doing a history slash Y project to figure out why we have the people we have, and to make sure we all have a common understanding of history. In the last couple of moments, I want to talk briefly about diversity. In Fedora, we've been lucky to have an active diversity team. We appointed a diversity advisor. She served for quite a while. She had some challenges in her personal life that resulted in her needing to step back. And we're in the process of changing the governance around this again, so that our new active diversity team is going to send us a diversity representative instead of having some random person appointed. It's a great way to, again, contribute back to community conversations. That team has run ten events around Fedora Women's Day this year. They did two last year. So we're seeing great activity on a targeted focus of diversity. There are lots of challenges there. And for all of you who are in projects of any kind, I encourage you to take a strong look at all of these challenges, because you probably have many of them too. We're reviewing our code of conduct. Reporting is vague. We don't really know what to do with reports. We're looking at a diversity survey. We're trying to figure out whether this is a mind-share outreach problem or a council governance problem. And of course, we're fixing that diversity advisor. Just the notes of where things came from, and my contact information, and I see questions.\"}"
